; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	infrared2 - mode
	spectrograph0 - mode
	image1 - mode
	Star0 - direction
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon18)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet19)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star1)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet8)
)
(:goal (and
	(pointing satellite3 Phenomenon9)
	(pointing satellite4 Planet11)
	(have_image Planet4 image1)
	(have_image Phenomenon5 image1)
	(have_image Planet7 image1)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 spectrograph0)
	(have_image Planet13 infrared2)
	(have_image Phenomenon14 infrared2)
	(have_image Star15 infrared2)
	(have_image Phenomenon17 infrared2)
	(have_image Phenomenon18 infrared2)
	(have_image Phenomenon20 spectrograph0)
	(have_image Star21 spectrograph0)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 16
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 16
3. (turn_to satellite4 phenomenon10 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 16
4. (turn_to satellite4 planet11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet11)
   goals met: 1 of 16
5. (turn_to satellite4 star1 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 star1)
   goals met: 0 of 16
6. (calibrate satellite4 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 16
7. (turn_to satellite4 phenomenon10 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 16
8. (take_image satellite4 phenomenon10 instrument7 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 1 of 16
9. (turn_to satellite4 phenomenon20 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon20)
   goals met: 1 of 16
10. (take_image satellite4 phenomenon20 instrument7 spectrograph0)
   added: (have_image phenomenon20 spectrograph0)
   goals met: 2 of 16
11. (turn_to satellite4 phenomenon5 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon5)
   goals met: 2 of 16
12. (take_image satellite4 phenomenon5 instrument7 image1)
   added: (have_image phenomenon5 image1)
   goals met: 3 of 16
13. (turn_to satellite4 phenomenon9 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 phenomenon9)
   goals met: 3 of 16
14. (take_image satellite4 phenomenon9 instrument7 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 4 of 16
15. (turn_to satellite4 planet11 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet11)
   goals met: 5 of 16
16. (take_image satellite4 planet11 instrument7 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 6 of 16
17. (turn_to satellite3 phenomenon9 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 phenomenon9)
   goals met: 7 of 16
18. (turn_to satellite2 groundstation2 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 groundstation2)
   goals met: 7 of 16
19. (calibrate satellite2 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 7 of 16
20. (turn_to satellite2 phenomenon14 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon14)
   goals met: 7 of 16
21. (take_image satellite2 phenomenon14 instrument2 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 8 of 16
22. (turn_to satellite2 phenomenon17 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon17)
   goals met: 8 of 16
23. (take_image satellite2 phenomenon17 instrument2 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 9 of 16
24. (turn_to satellite2 phenomenon18 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon18)
   goals met: 9 of 16
25. (take_image satellite2 phenomenon18 instrument2 infrared2)
   added: (have_image phenomenon18 infrared2)
   goals met: 10 of 16
26. (turn_to satellite2 planet13 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 planet13)
   goals met: 10 of 16
27. (take_image satellite2 planet13 instrument2 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 11 of 16
28. (turn_to satellite2 star15 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star15)
   goals met: 11 of 16
29. (take_image satellite2 star15 instrument2 infrared2)
   added: (have_image star15 infrared2)
   goals met: 12 of 16
30. (turn_to satellite4 planet12 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet12)
   goals met: 11 of 16
31. (take_image satellite4 planet12 instrument7 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 12 of 16
32. (turn_to satellite4 planet11 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet11)
   goals met: 13 of 16
33. (turn_to satellite4 planet4 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet4)
   goals met: 12 of 16
34. (take_image satellite4 planet4 instrument7 image1)
   added: (have_image planet4 image1)
   goals met: 13 of 16
35. (turn_to satellite4 planet11 planet4)
   deleted: (pointing satellite4 planet4)
   added: (pointing satellite4 planet11)
   goals met: 14 of 16
36. (turn_to satellite4 planet7 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet7)
   goals met: 13 of 16
37. (take_image satellite4 planet7 instrument7 image1)
   added: (have_image planet7 image1)
   goals met: 14 of 16
38. (turn_to satellite4 planet11 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet11)
   goals met: 15 of 16
39. (turn_to satellite4 star21 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 star21)
   goals met: 14 of 16
40. (take_image satellite4 star21 instrument7 spectrograph0)
   added: (have_image star21 spectrograph0)
   goals met: 15 of 16
41. (turn_to satellite4 planet11 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 planet11)
   goals met: 16 of 16
